#include <iostream>

int main() {
    int forks[2][6] = {{1, 1, 1, 1, 1, 1},
                       {1, 1, 1, 1, 1, 1}};
    int spoons[2][6] = {{1, 1, 1, 1, 1, 1},
                        {1, 1, 1, 1, 1, 1}};
    int knives[2][6] = {{1, 1, 1, 1, 1, 1},
                        {1, 1, 1, 1, 1, 1}};
    int plates[2][6] = {{1, 1, 1, 1, 1, 1},
                        {1, 1, 1, 1, 1, 1}};
    int dessert[2][2] = {{1, 1},
                         {1, 1}}; //десертная ложка и тарелка
    int chairs[2][6] = {{1, 1, 1, 1, 1, 1},
                        {1, 1, 1, 1, 1, 1}};
    chairs[1][5] += 1; //на первый ряд пятое место был добавлен один стул для дамы с ребенком
    spoons[2][3] -= 1; // украдена ложка со второго ряда третьего места
    spoons[0][1] -= 1; // vip поделился ложкой
    spoons[2][3] += 1; // ложка вернулась
    dessert[0][0] -= 1; //официант забрал десертную тарелку

}
